; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v8 - type_3 ?v7 - type_1)
 	      (pred_4 ?v2 - object ?v7 - type_1)
	      (pred_3 ?v8 - type_3 ?v5 - type_2)
	      (pred_1 ?v8 - type_3 ?v2 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v8 - type_3 ?v6 ?v4 - type_1)
       :precondition (and  (pred_2 ?v8 ?v6))
       :effect (and  (pred_2 ?v8 ?v4)
		     (not (pred_2 ?v8 ?v6))))

   (:action op_2
       :parameters (?v8 - type_3 ?v1 - object ?v3 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v3) (pred_2 ?v8 ?v3) (pred_3 ?v8 ?v5))
       :effect (and (pred_1 ?v8 ?v1 ?v5)
		    (not (pred_4 ?v1 ?v3)) 
		    (not (pred_3 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_3 ?v1 - object ?v3 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v8 ?v1 ?v5) (pred_2 ?v8 ?v3))
       :effect (and (pred_4 ?v1 ?v3)
		    (pred_3 ?v8 ?v5)
		    (not (pred_1 ?v8 ?v1 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_07 - type_3
obj_09 obj_12 obj_02 obj_08 - type_2
obj_03 obj_06 obj_05 obj_11 - type_1
obj_10 obj_04 obj_01 - object)
(:init
(pred_2 obj_13 obj_11)
(pred_3 obj_13 obj_09)
(pred_3 obj_13 obj_12)
(pred_2 obj_07 obj_03)
(pred_3 obj_07 obj_02)
(pred_3 obj_07 obj_08)
(pred_4 obj_10 obj_05)
(pred_4 obj_04 obj_05)
(pred_4 obj_01 obj_11)
)
(:goal
(and
(pred_4 obj_10 obj_11)
(pred_4 obj_04 obj_03)
(pred_4 obj_01 obj_05)
)
)

(:constraints
  (always (not (pred_2 obj_13 obj_05)))
)
)

; plan
1. (op_2 obj_13 obj_01 obj_11 obj_12)
   deleted: (pred_4 obj_01 obj_11) (pred_3 obj_13 obj_12)
   added: (pred_1 obj_13 obj_01 obj_12)
   goals met: 0 of 3
2. (op_1 obj_07 obj_03 obj_05)
   deleted: (pred_2 obj_07 obj_03)
   added: (pred_2 obj_07 obj_05)
   goals met: 0 of 3
3. (op_2 obj_07 obj_04 obj_05 obj_08)
   deleted: (pred_4 obj_04 obj_05) (pred_3 obj_07 obj_08)
   added: (pred_1 obj_07 obj_04 obj_08)
   goals met: 0 of 3
4. (op_1 obj_07 obj_05 obj_03)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_03)
   goals met: 0 of 3
5. (op_3 obj_07 obj_04 obj_03 obj_08)
   deleted: (pred_1 obj_07 obj_04 obj_08)
   added: (pred_4 obj_04 obj_03) (pred_3 obj_07 obj_08)
   goals met: 1 of 3
6. (op_1 obj_07 obj_03 obj_05)
   deleted: (pred_2 obj_07 obj_03)
   added: (pred_2 obj_07 obj_05)
   goals met: 1 of 3
7. (op_2 obj_07 obj_10 obj_05 obj_08)
   deleted: (pred_4 obj_10 obj_05) (pred_3 obj_07 obj_08)
   added: (pred_1 obj_07 obj_10 obj_08)
   goals met: 1 of 3
8. (op_1 obj_07 obj_05 obj_11)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_11)
   goals met: 1 of 3
9. (op_3 obj_07 obj_10 obj_11 obj_08)
   deleted: (pred_1 obj_07 obj_10 obj_08)
   added: (pred_4 obj_10 obj_11) (pred_3 obj_07 obj_08)
   goals met: 2 of 3
10. (op_3 obj_13 obj_01 obj_11 obj_12)
   deleted: (pred_1 obj_13 obj_01 obj_12)
   added: (pred_4 obj_01 obj_11) (pred_3 obj_13 obj_12)
   goals met: 2 of 3
11. (op_2 obj_07 obj_01 obj_11 obj_08)
   deleted: (pred_4 obj_01 obj_11) (pred_3 obj_07 obj_08)
   added: (pred_1 obj_07 obj_01 obj_08)
   goals met: 2 of 3
12. (op_1 obj_07 obj_11 obj_05)
   deleted: (pred_2 obj_07 obj_11)
   added: (pred_2 obj_07 obj_05)
   goals met: 2 of 3
13. (op_3 obj_07 obj_01 obj_05 obj_08)
   deleted: (pred_1 obj_07 obj_01 obj_08)
   added: (pred_4 obj_01 obj_05) (pred_3 obj_07 obj_08)
   goals met: 3 of 3
